function mod_out=modulation36211(mod_in,mod_mode)
%%*************************************************************************
% 此调制函数是根据36.212写的

%%********************************************************
%system_parameters  
switch (mod_mode)
case 2 
    Temp=[1+j -1-j]./sqrt(2);
    mod_out = Temp(mod_in+1);%映射,注意加1，因为matlab没有a(0)项，而是从a(1)开始 

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
case 4
    Temp=[1+j  1-j  -1+j   -1-j];
    mod_in = reshape(mod_in,2,length(mod_in)/2);%将输入序列转化为(2,length(x)/2)的矩阵
    mod_out = Temp([2 1]*mod_in+1)/sqrt(2);%映射,注意加1，因为matlab没有a(0)项，而是从a(1)开始

    
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
case 16
  Temp=[1 + 1i	1 + 3i	3 + 1i	3 + 3i ...
      1 - 1i	1 - 3i	3 - 1i	3 - 3i ...
      -1 + 1i	-1 + 3i	-3 + 1i	-3 + 3i	 ...
      -1 - 1i	-1 - 3i	-3 - 1i	-3 - 3i]/sqrt(10);
   mod_in = reshape(mod_in,4,length(mod_in)/4);%将输入序列转化为(4,length(x)/4)的矩阵
   mod_out = Temp([8 4 2 1]*mod_in+1);%映射,注意加1，因为matlab没有a(0)项，而是从a(1)开始

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
case 64
  Temp=[3 + 3i	3 + 1i	1 + 3i	1 + 1i	3 + 5i	3 + 7i	1 + 5i	1 + 7i ...
      5 + 3i	5 + 1i	7 + 3i	7 + 1i	5 + 5i	5 + 7i	7 + 5i	7 + 7i ...
      3 - 3i	3 - 1i	1 - 3i	1 - 1i	3 - 5i	3 - 7i	1 - 5i	1 - 7i ...
      5 - 3i	5 - 1i	7 - 3i	7 - 1i	5 - 5i	5 - 7i	7 - 5i	7 - 7i ...
      -3 + 3i	-3 + 1i	-1 + 3i	-1 + 1i	-3 + 5i	-3 + 7i	-1 + 5i	-1 + 7i ...
      -5 + 3i	-5 + 1i	-7 + 3i	-7 + 1i	-5 + 5i	-5 + 7i	-7 + 5i	-7 + 7i ...
      -3 - 3i	-3 - 1i	-1 - 3i	-1 - 1i	-3 - 5i	-3 - 7i	-1 - 5i	-1 - 7i ...
      -5 - 3i	-5 - 1i	-7 - 3i	-7 - 1i	-5 - 5i	-5 - 7i	-7 - 5i	-7 - 7i]/sqrt(42);

   mod_in = reshape(mod_in,6,length(mod_in)/6);%将输入序列转化为(6,length(x)/6)的矩阵
   mod_out = Temp([32 16 8 4 2 1]*mod_in+1);%映射,注意加1，因为matlab没有a(0)项，而是从a(1)开始

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
otherwise
    disp('Error! Please input again');
end
